{
    "title": "Am I the A-Hole for my husband missing his daughters prom?",
    "selftext": "I 36 female have been married to my husband Josh 40 for 10 years. We have a 9 year old daughter Lauren together and my step daughter Riley is 18. \n\nAbout a year ago I booked a vacation with my girlfriends for one of their bachelorette parties. It’s this weekend in Tennessee. We leave Thursday and come back Monday. \n\nThis weekend Lauren has a cheerleading competition that Josh is taking her to. Lauren is required to have a guardian there the whole time and she needs to arrive early Friday and leaving Sunday. We did ask the cheer director if a friends mom could bring her and my husband could meet her there after but they said no. And if she’s not there for the check in time she can’t compete that weekend. \n\nRiley’s prom is Friday. Riley did not have a junior prom and her school only has senior prom. We found out the date of prom after school started and the trip had already been booked and paid for. \n\nMy husband is now going to be missing Riley’s prom to take Lauren to her competition. \n\nRiley thinks this is extremely unfair and that we’re playing favorites since she’ll never get this chance again and she wants pictures with her dad and sister. She’s been messaging my husband about it. \n\nLauren doesn’t want to miss her competition and risk her spot on her team. \n\nMy husband asked if I’d cancel my trip and I told him no. The trip has been booked, paid for, and I also need a break. He takes breaks and trips as well. \n\nMy husband and I are now fighting because he feels like no matter what he does he’s stuck. He’s already told Lauren he’ll be taking her to the cheer comp which means he’ll be missing prom. \n\nSo AITA?\n\nUpdate: \n\nI have decided to stand my ground that I will not be cancelling my trip. I will be getting on the plane in the morning. \n\nJosh just sat down me, Riley, and Lauren to talk about the weekend. He explained he’ll be taking Lauren to her competition while Riley’s mother takes pictures with her at prom. He said he taught the girls about commitment and he’s not going to have Lauren’s absence have the team Forfeit. \n\nHe told her we could do pictures if she wanted to put her dress on a second time but she said it won’t be the same and she’s upset. \n\nRiley is upset with her father and thinks he’s favoring Lauren.",
    "author": "Extension-Marzipan86",
    "ups": 6162,
    "utc_timestamp": 1682564925.0,
    "relative_time": "18 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13083rd/aita_for_my_husband_missing_his_daughters_prom/",
    "date_time": "2023-04-26 20:08:45",
    "comments": [
        {
            "author": "BrewertonFats",
            "comment": "Nah.\n\nWhomever is organizing the cheerleader competition is the asshole.  There is no reason they should restrict another member of the family from bringing her, or simply allowing her to go with another parent and a permission slip."
        },
        {
            "author": "MadTownMich",
            "comment": "Also, You're the A-Hole as is your husband. Prom happens once. Your 9 year old has plenty of cheerleading competitions. The focus should be the once in a lifetime deal. No wonder your stepdaughter is totally pissed. Do better"
        },
        {
            "author": "lovimoment",
            "comment": "I don't get why everyone is acting like an adult's world needs to revolve around prom. I remember who I went to prom with, I don't remember the hour at my house beforehand where the parents insisted on taking photos. I know for a fact some of the parents weren't there for the photos, because they had to work or do other stuff. It's prom, not a wedding or a graduation. Prom is about the kids spending time with each other, it's not a family event."
        }
    ]
}