{
    "title": "would I be the A-Hole for spraying some kid with my garden hose daily after he walks all over our lawn",
    "selftext": "I (37M) live with my wife (37F) and son and daughter ( 9 and 11 respectively).\n\nRecently, there has been this kid who comes by our house after playing soccer and either rides his bike or walks over the lawn with his cleats on his way home.\n\nIt started out as me giving him stern looks whenever I saw him, then it slowly progressed to me asking him to just go around.\n\nThe last time I asked him to stop he made a point to stomp extra hard and twist his feet in to the grass to piss me off.\n\nSince then Ive just been hosing him. The first time I sprayed him with the hose he ran off, but then for some reason he just started standing there while I hose him like he enjoys it.\n\nIts now progressed to me sitting on my lawn chair pointing my hose at him, and him just staring at me while he does so. Sometimes we even make small talk.\n\nIm ngl, it started off as a really bitter relationship, but Ive actually gotten to know the kid quite well, we talk for maybe 15-20 mins everyday, and he doesnt seem to mind being hosed down after sweating hard playing soccer.\n\nHe comes by daily and we just shoot the shit while I hose him and he stands there for a bit.\n\nWife told me I need to stop, even after I explained it to her she said Im making us look like childish idiots.\n\nI guess I could stop, but honestly its really funny waiting for him to come by and I see no harm in it. WIBTA?",
    "author": "tway23421",
    "ups": 18686,
    "utc_timestamp": 1683267505.0,
    "relative_time": "23 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/138csc5/wibta_for_spraying_some_kid_with_my_garden_hose/",
    "date_time": "2023-05-04 23:18:25",
    "comments": [
        {
            "author": "DearDorothy",
            "comment": "Ok this is hilarious. I was going to say you were the A-Hole and get a fence, but I see nothing wrong with what’s going on now. NAH."
        },
        {
            "author": "kokonikoreteureshii",
            "comment": "I mean the kid sounds like kind of an AH. But I guess No A-Holes Here haha.\n\nKid is obviously deprived of attention and is weirdly getting something bizarrely meaningful from this incredibly strange relationship haha. Has he stopped trying to damage your lawn?"
        },
        {
            "author": "MagixTurtle",
            "comment": "Get another chair, ask the kid to come sit with you.  That kid rather gets hosed down by a stranger than go home, something's up."
        }
    ]
}