{
    "title": "would I be the A-Hole if I took my son and his friends out for his birthday instead of my wife and step-daughters?",
    "selftext": "I (m42) have three kids. A son Isaac (12 almost 13) with my ex who is no longer in the picture and twin step-daughters from my wife’s previous relationship; Emma and Ava (7). \n\nIsaac’s 13th birthday is coming up next week, and he said that he wants to go to the movies, and asked if he could bring two friends along. I agreed, and we planned a day out of fun (arcade, pizza, and a movie). These were all activities that I know that my son and his friends (nerdy middleschool boys) would enjoy. \n\nWhen I told my wife about our plans, she suggested that we should have a family outing instead, and proposed a local kiddy playplace that my step-daughters apparently love. I said that Isaac and his friends would be very disappointed, and that he wouldn’t have fun at the kiddy playplace. \n\nShe tried to convince me that Isaac could still have fun because there was an ‘arcade’ (two claw machines, a pinball table, and a small DDR machine). She also said that, since he sees his friends at school everyday, family time should be prioritized over friends. \n\nI told her that it was unfair to force Isaac to spend his birthday at a kiddy playplace instead of with his friends. She accused me of favoritism and of not loving my step-daughters as much Isaac. This hit me pretty hard because I grew up with a step-father who neglected me in favor of his own kids, and I’ve been trying my hardest to be the father figure I never had. \n\nI’ve been spiraling down a rabbit hole of doubt about my own choices, and for the sake of my own sanity, WIBTA?",
    "author": "ItsamiaThrowaway",
    "ups": 9210,
    "utc_timestamp": 1683419081.0,
    "relative_time": "19 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13a76uv/wibta_if_i_took_my_son_and_his_friends_out_for/",
    "date_time": "2023-05-06 17:24:41",
    "comments": [
        {
            "author": "Fit-Establishment219",
            "comment": "Say \"I would never ask the girls to spend their bday doing something Isaac wanted to do and you should show the same respect\"\n\nAlso. She's gaslighting the F out of you. And I'm betting it's not the first time"
        },
        {
            "author": "Chaos-in-a-CookieJar",
            "comment": "You Would Not be the A-Hole \n\nIronically, if you did go along with your wife’s idea, you would be showing favoritism to your stepdaughters over your son. Stand your ground, your wife is emotionally manipulating you."
        },
        {
            "author": "Lvmllsy",
            "comment": "NTA! A play place is not somewhere a 13 year old lad wants to take his friends for his birthday. it’s HIS birthday, not the daughters. as much as i understand the wanting to do family things, you can do that on another day!"
        }
    ]
}