{
    "title": "Am I the A-Hole for not giving my mom my old medication?",
    "selftext": "NSFW due to mentions of drugs\n\nI am a recovering addict. I used to have xanax prescribed to me for panic attacks but it was discontinued. I kept an old bottle in the cupboard just in case (I know, I know.)\n\nOn Saturday my parents came over. I told them how I was doing in my recovery and that I was going to properly dispose of my old Xanax at the pharmacy or police department. \n\nFor the sake of brevity, she asked me for the drugs and I said No. My No was not respected. When I said no she said “well why, I’m not an addict!” She then proceeded to rub my nose in the fact that I stole drugs from her when I was in active addiction, and basically said I owed her. \n\nI was so upset, that I brought up a time she medicated me without a doctor’s consent or prescription when I was a child. She then gaslit me, saying I was making it up and that never happened. I kicked her out of my house. \n\nI’m so upset. I’m in very early recovery and trying my hardest to get well. We haven’t spoken since I kicked her out and my heart hurts. I just wanted my mom to be proud of me, but instead she tried to guilt me for my old medication. So Reddit, AITA?\n\n(I disposed of the medicine the next day at the police department). I’m 7 days sober from my drug of choice today.\n\nEdit: I just want to say thank you to everyone for wishing me well in my sobriety. I appreciate all of you and your responses so, so much!\n\nEdit 2: Just wanted to add that I do attend NA meetings daily and have a sponsor, for those concerned about my recovery. And thank you again. I’m crying reading all of these supportive responses.\n\nEdit 3: Dog tax has been posted to my profile",
    "author": "confusedhuskynoises",
    "ups": 8400,
    "utc_timestamp": 1682597174.0,
    "relative_time": "18 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/130jy73/aita_for_not_giving_my_mom_my_old_medication/",
    "date_time": "2023-04-27 05:06:14",
    "comments": [
        {
            "author": "smg658",
            "comment": "NTA. If she needs the meds let her get them prescribed. Well done on your seven days."
        },
        {
            "author": "MEsyas",
            "comment": "NTA. Meds are prescribed for you and for you only. And especially Xanax isn't candy you can just hand out.\n\nThe fact that you stole meds from her in the past has nothing to do with that. In fact, reconsider how often you see your mother if she's continuously going to bring up your past to get something from you."
        },
        {
            "author": "JohnVirginia1977",
            "comment": "NTA. You acted responsibly, and I’m not sure how old you are, but your mother seems to treat you like a child still. Good luck on your recovery."
        }
    ]
}