{
    "title": "Am I the A-Hole for calling my friend's proposal disrespectful?",
    "selftext": "Alright, so here's the deal. My friend (m27) decided to propose to his girlfriend of 3 years, Dina. (F26). The two met at a bar pre-COVID, and were just chatting at first but it quickly led to more and eventually the two of them moved in together and discussed marriage.\n\nPersonally, I think they're a great match, and my friend, Stephen, has never been happier. He told me that he was planning to propose to Dina, and I was ecstatic.\n\nWell, the day of the proposal hits, and I called Stephen the next day, which was last night, to congratulate him. But he wasn't happy. He told me that Dina had said no. I was shocked, and asked if he knew why. He said that she didn't like how he proposed. \n\nNow here's the thing. I knew he was going to pop the question, but I didn't know how he was going to do it. He thought it would be romantic to propose at the place they met...yes. A bar.\n\nAlready I could kind of see why she might not like that, but I decided to ask her privately because she and I have gotten to be close. She confided in me that it's because she told Stephen multiple times that she didn't want to have a public proposal, and that she was horrified he would do it at a bar of all places and that she felt disrespected that he didn't accommodate that.\n\nI told Stephen that his proposal was honestly really disrespectul and seriously kind of messed up, to which he told me I was being an insensitive A-Hole and should be supportive as his friend rather that talking down on him, but I don't know if I'm wrong here.\n\nAm I the A-Hole for calling my friend's proposal disrespectful?\n\nEDIT TO CLARIFY: I am actually female, for those saying \"him\".",
    "author": "pokemonkandy",
    "ups": 9444,
    "utc_timestamp": 1683902862.0,
    "relative_time": "14 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13fn8s6/aita_for_calling_my_friends_proposal_disrespectful/",
    "date_time": "2023-05-12 07:47:42",
    "comments": [
        {
            "author": "Dicecoldkilla",
            "comment": "Not the A-Hole Stephen should have ........................................................................................................................................................................................................................................................................................................................................set the bar higher. \n\n&amp;#x200B;\n\nI'll see myself out."
        },
        {
            "author": "concernedreader1982",
            "comment": "Stephen is the asshole. If his GF told him NOT to propose in a public setting, he should've respected that. The bar thing doesn't bother me b/c it's their first date. Whats bothersome is he did something she specifically asked him not to and now his feelings are hurt b/c he didn't listen to her.\n\nNot the A-Hole"
        },
        {
            "author": "violaflwrs",
            "comment": "NTA. He’s the one who’s not listening to what his partner is saying."
        }
    ]
}