{
    "title": "Am I the A-Hole for blowing up at my mom when she said the reason I turned out so good is because she sent me to rehab for weed at 13?",
    "selftext": "I'll (20M) admit I was a shitty tween. I got into alot of fights with my parents, my grades were shit, and I was generally a prick. When I was 13 some friends and I shared a joint one of them had gotten from their sister (It had just been made legal in our state at the time) My parents found out, and they went nuts.\n\nNow I get that weed isn't for 13 year olds, but they took it way too far. I spent the next three months in an expensive rehab facility for troubled teens. I was by far the youngest and smallest, most of these guys were 16-18. And they weren't in there for weed, most of them did hard drugs, and had mental issues on top of that.\n\nMy roommate was a 17 year old who was detoxing from meth and pills, who also had unmedicated bipolar. A few nights he'd just stare at me and not sleep. We were in our rooms 18 hours a day, everything else was meals or shitty arts and crafts. It was hell, but it worked, I was too terrified to have friends, much less do drugs.\n\nI wanted to go NC with my family at 18, but my therapist encouraged me to repair our relationship. We have a rocky one, which is why I moved out, but we've been working on healing and it's been cordial. I was over there for easter with the whole family, and my mom congradulated me.\n\nShe said she was so thankful she had me sent to \"get help\" as a kid, otherwise I'd just be some junkie. But now I'm a perfectly functioning member of society. I lost it, I called her several things, including c*nt and left. My sister (18F) said that while she agrees, I'm just hurting myself by holding on to so much anger over what happened.",
    "author": "Working-Force4192",
    "ups": 10299,
    "utc_timestamp": 1682672366.0,
    "relative_time": "11 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/131m5we/aita_for_blowing_up_at_my_mom_when_she_said_the/",
    "date_time": "2023-04-28 01:59:26",
    "comments": [
        {
            "author": "MerlinBiggs",
            "comment": "NTA. You were traumatized by your experience. This has clearly been building up for some time. You may not have reacted in the best way, but what she did was way too extreme for a single joint. Keep up with the therapy. Maybe NC for a while will be good for you."
        },
        {
            "author": "MayaPinjon",
            "comment": "Also, what fucking rehab center takes a 13-year old without a, drug problem for 3 months. Sounds like major malpractice to me."
        },
        {
            "author": "ceciliamidwinter",
            "comment": "NTA. I would have went no contact tbh. Can't imagine being shipped off to some facility, being traumatized by it and then hearing how good it was for me. The audacity."
        }
    ]
}