{
    "title": "Am I the A-Hole for not inviting my brother and sister in law to meet my baby because they didn't have visitors for three months after they had their baby?",
    "selftext": "When my sister in law had her son approx 7 months ago her and my brother did the \"we're taking this time as a family and we won't be having visitors in the hospital or meeting the baby for the first couple months, thanks for respecting our time etc\" thing and they did not have any visitors over for the first three months as she said. I totally respected this. Brother didn't rly care about visitors either way but she specifically didn't want any visitors. So anyway I had my baby two weeks ago and I did have visitors in the hospital and at my house and my close family members (mom, sisters, cousins, god mother, aunts and uncles, grandparents) except my brother and his wife. Yesterday I had a family dinner where my family came over and cooked for me and held the baby etc. Some people posted pics of this get together on social media. I DID NOT POST THEM! My sister in law saw these pics and was like I would love to meet the baby bla bla bla. She told my brother to ask why they weren't invited. Brother didn't really care he just asked on her behalf. I was like y'all can meet my baby after three months. Thank you for respecting my choice. You didn't want me to meet my nephew for three months, so you can meet your niece after three months. So now she posted a subtweet about me and I don't get why. She didn't let people meet her baby for three months so why should I let her meet mine? I respected her choice so I don't understand what the problem is.",
    "author": "Wide-Efficiency807",
    "ups": 6747,
    "utc_timestamp": 1682835172.0,
    "relative_time": "13 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/133hgpt/aita_for_not_inviting_my_brother_and_sister_in/",
    "date_time": "2023-04-29 23:12:52",
    "comments": [
        {
            "author": "SpeedBlitzX",
            "comment": "I think the reason she isn't happy is because they feel like you singled them out. Whereas when they told everyone they could visit after three months that rule applied to everyone. No one got special treatment. When they had their kid. \n\n\nIt looks like you took it personally though.\n\nYou're the A-Hole"
        },
        {
            "author": "PantsPartyPirate",
            "comment": "You're the A-Hole and being very petty as everyone else was invited to visit yours,  and the three month rule for your niece applied to everyone.  There are reasons why some parents say no visitors for a while. Post birth recovery, post natal depression, unusual mother / baby health issues, for example"
        },
        {
            "author": "lrknst",
            "comment": "YTA, they had a blanket rule for everyone which helped Mom recover after giving birth. Lots of hormones and emotions and firsts! Can be a very stressful time for some. It’s clear you took that personally and are now singling them out to try to prove some non existent point."
        }
    ]
}