{
    "title": "AITA for giving a mother with a crying baby my seat near my wife to teach her a lesson?",
    "selftext": "So my wife and I recently went on a trip together payed for by her dad. He flew us to Hawaii with first class seats. We had a great time. My wife is used to travel while I’m les experienced with plane travel, this was the first time I flew first class. On our way back home, we were sat near the back we’re by the border between us and the “undesirables”. A mother and her baby were one of the first to board and the poor baby was not having a good time. I felt even worse got the mother as I know she’s probably equally distressed about the baby crying.\n\nWhile I felt sympathy, my wife was mad. She kept making comments about how our flight was going to be miserable as the best. Her completing went on for the longest time. She kept saying that the mother was irresponsible and if she doesn’t know how to calm her baby, she shouldn’t be taking it on a plane. I tried to tell her to calm down as it’s not that serious but she wasn’t having it. Eventually I got tired of that, so I offered to go speak to the mom for my wife. She said she would be happy if I did.\n\nI went back in between boarding groups and told the mother that if she wanted, I would give her my first class seat so she can kick her feet up and that may be more comfortable for her and the baby. She didn’t want to initially but I insisted and her husband encouraged her to take it. She took her baby up to first class and I got series of angry texts from my wife.\n\nSo I felt like this was not a huge deal as my wife brought noise canceling headphones. And the other people in first class most likely do as well. And if they don’t, they have normal headphones and can simply block out the baby. It’s 2023, not 1990. We’re not living in the Stone Age.\n\nThe baby cried for maybe a cumulative 30 minutes on an 8 hour flight. So barely at all. When my wife and I met up, she was livid. She told me that I ruined her flight and ruined the end of the trip for her. I told her that she’s overreacting to something that’s only mildly annoying. She has refused to drop this.\n\nAITA?",
    "author": "TaxRightoffer",
    "ups": 8693,
    "utc_timestamp": 1683211021.0,
    "relative_time": "13 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/137n9ac/aita_for_giving_a_mother_with_a_crying_baby_my/",
    "date_time": "2023-05-04 07:37:01",
    "comments": [
        {
            "index": 1,
            "author": "workinkindofhard",
            "comment": "Lol no one gives up a first class seat on an 8 hour flight just to 'teach their wife a lesson' this is one of the weaker troll posts I have seen on here lately",
            "ups": 2697,
            "utc_timestamp": 1683213332.0,
            "relative_time": "12 hours ago",
            "date_time": "2023-05-04 08:15:32"
        },
        {
            "index": 2,
            "author": "[deleted]",
            "comment": "[removed]",
            "ups": 9020,
            "utc_timestamp": 1683211709.0,
            "relative_time": "12 hours ago",
            "date_time": "2023-05-04 07:48:29"
        },
        {
            "index": 3,
            "author": "OSU725",
            "comment": "Can I get, things that didn’t happen for 100 Alex??",
            "ups": 911,
            "utc_timestamp": 1683213629.0,
            "relative_time": "12 hours ago",
            "date_time": "2023-05-04 08:20:29"
        }
    ]
}