{
    "title": "AITA for telling off my MIL for insisting my daughter doesn't have a \"real\" vagina?",
    "selftext": "My 4.5 yo daughter has a stomach bug, and has been having some diarrhea. My wife needed to take our son to an appt nd I needed to WFH today so my MIL came to watch after our daughter.\n\nMy daughter needed to use the bathroom, and I was going to excuse myself from my online meeting but my MIL said she had it. A bit later, my daughter came up to me and asked me to wipe her. I said to her, didn't Grandma help you? (She knows how to wipe, but with her having diarrhea we're helping her). She said yes, but Grandma wiped wrong. She said Grandma wiped in instead of out. (We've taught her to wipe out instead of in.)\n\nI excused myself from my meeting to help wipe my daughter correctly. I went to find my MIL in the kitchen. I asked her, [daughter] says you wiped in instead of out? She said, I wiped her, you think there's a better way? I told her it's not healthy to wipe into the vagina, you need to wipe out. She said, and you have a vagina? I said no, but I have a daughter, and I won't let her get an infection by wiping poop into her vagina. She said, [daughter] doesn't have a real vagina yet, there's no chance of infecting anything. I said, what...? Of course she has a real vagina, she's a female. She said, girls don't have real vaginas until their teenagers. And that there's no chance of any infection because their vagina doesn't actually develop until they're a teenager. I was... dumbfounded. And I got angry.\n\nI said to her, \"You're a woman, you raised three daughters, I'm married to one... you can't possibly be this stupid?\" \n\nShe told me I'm out of line and said if I can't appreciate her help then she's leaving. I told her I'm perfectly, in fact definitely more capable than her of caring for my daughter, and that she's welcome to get out. She did leave, and about ten minutes layer my wife called me and said her mom was furious with me and said I was terrible to her and made her leave without any reason. After explaining, my wife is on my side. \n\nAITA for defending my daughter's \"real\" vagina?",
    "author": "buttsforhats",
    "ups": 26856,
    "utc_timestamp": 1683115572.0,
    "relative_time": "18 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/136imou/aita_for_telling_off_my_mil_for_insisting_my/",
    "date_time": "2023-05-03 05:06:12",
    "comments": [
        {
            "index": 1,
            "author": "IWantToBuyAVowel",
            "comment": "NTA, your MIL is profoundly stupid, not for not knowing how to wipe, but for not realizing that 4yo girls have fully formed genitals. God knows what other pearls of wisdom she has in her brain.",
            "ups": 38780,
            "utc_timestamp": 1683117467.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-05-03 05:37:47"
        },
        {
            "index": 2,
            "author": "Ceecee_soup",
            "comment": "NTA obviously but I just want to take a moment and acknowledge that your daughter did such a good job of advocating for herself in that situation!! I hope you and your wife have a talk with her to reinforce that she did the right thing!!\n\nETA: thanks for the award! WE LOVE STRONG GIRLS THAT ADVOCATE FOR THEIR BODILY AUTONOMY AND WE LOVE THE PARENTS THAT RAISE THEM!!!!!!",
            "ups": 19824,
            "utc_timestamp": 1683118599.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-05-03 05:56:39"
        },
        {
            "index": 3,
            "author": "EastPractice2616",
            "comment": "NTA.  Urinary tract infections!  Bladder infections!\n\nWhile a tiny human is not fully developed in terms of sexual organs, that doesn't mean poop should be in there. \n\nThat's just gross.\n\n*fixed spelling*",
            "ups": 7106,
            "utc_timestamp": 1683117049.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-05-03 05:30:49"
        }
    ]
}