{
    "title": "AITA for returning a birthday gift I got for my boyfriend after he insulted me about my “colorful” past?",
    "selftext": "This happened last night but my phone is still blowing up. \n\nI F(26) dipped into my savings and got Mike, my boyfriend (27) a PS5 for his birthday yesterday. \n\nHe knew he was getting the PS5 because he told me that the PS5 is the only thing he wants. We’ve been together for 4 years so the cost didn’t matter. That is until, I found out what he thinks about me. \n\nSome background: When I was 18, I was involved with Jake, a guy who I met online. We ended things after 3 months, and I moved on shortly after with Adam, a guy from work. \n\nI found out a couple months later that Jake and Adam were actually really close friends but I didn’t know Jake long enough to meet his friend group, so I had no idea. \n\nAfter finding out, I took some time off dating and two years later, I met my current boyfriend Mike.\n\nI was upfront and honest with Mike about my past and the fact that I was unintentionally involved with friends. He said he understood and my past didn’t bother him.\n\nLast night at his party, I showed up with the PS5 and him and his friends were screaming with joy.\n\nHis best female friend Jessica laughed and said “I wish I was a thot so I could afford a PS5 too.”\n\nI looked at her with an “excuse me?” Look on my face and she just said “nevermind” and walked away. \n\nI confronted my boyfriend about it and he said and I quote “she’s just messing with you. You can’t take a joke?”\n\nSo I pushed further as to why this girl is even calling me names to begin with and he said “well, everyone knows you were a thot before you met me.” \n\nI asked him to explain how I was a thot before him and he said “you know…messing with best friends?” \n\nHe then pat me on the shoulder and said that it’s okay because I’m not who I was back then and if he could get over my “colourful past” and “thot mentalities” to give me a chance, then I could get over Jessica’s comments and give her another chance.\n\nI didn’t say anything. I just got up. Took the PS5 from the gift table and left.\n\nHe was PISSED. He literally called me like 20 times, but I didn’t care. I was so hurt that I took the bow off and took it straight back to the store I got it from. They happily refunded it.\n\nI thought that was done but Mike and all his friends including Jessica are berating me for being petty and they’re all saying I brought this on myself by making poor choices. \n\nI responded to Mike and told him that he deserves better than me so find someone who wasn’t a “thot” and get the PS5 from them because I returned it. \n\nHe started screaming how I’m “the biggest AH” for returning it and how I should be happy he ignored my “colourful past.” \n\nI’m thinking maybe taking it back went too far. \n\nAITA?",
    "author": "PsychologicalMind407",
    "ups": 23925,
    "utc_timestamp": 1685019627.0,
    "relative_time": "16 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13rh62c/aita_for_returning_a_birthday_gift_i_got_for_my/",
    "date_time": "2023-05-25 06:00:27",
    "comments": [
        {
            "index": 1,
            "author": "SweetPotatoFamished",
            "comment": "I’m so confused. But maybe that’s because I’m an old lady who got married around the time you were in Kindergarten. \n\nA) if anyone was wrong in the Jake/Adam incident it was Adam. You might have dated friends, but he dated his best friend’s ex. That’s on them to figure out, and Adam’s mistake only.\n\n2) Where I come from, dating 3 dudes in 7 years does not a “colorful” past make. Did “ho” get a new definition since the early 00s? \n\nNTA\n\nAnd I hope you do something special for yourself with a little of that money you got back from returning that gift you got your ex boyfriend.",
            "ups": 41657,
            "utc_timestamp": 1685021185.0,
            "relative_time": "15 hours ago",
            "date_time": "2023-05-25 06:26:25"
        },
        {
            "index": 2,
            "author": "190PairsOfPanties",
            "comment": "NTA. Give him the keys to the curb. \n\nAlso- dollars to dildos he's cheating with Jessica.",
            "ups": 18977,
            "utc_timestamp": 1685020692.0,
            "relative_time": "16 hours ago",
            "date_time": "2023-05-25 06:18:12"
        },
        {
            "index": 3,
            "author": "[deleted]",
            "comment": "[removed]",
            "ups": 16912,
            "utc_timestamp": 1685020429.0,
            "relative_time": "16 hours ago",
            "date_time": "2023-05-25 06:13:49"
        }
    ]
}