{
    "title": "AITA for telling my best friend his gf is disgusting?",
    "selftext": "I (22f) have been friends with Danny (22m) since high school and he recently moved in with his current gf Lucy (22f). They had a housewarming party on Friday and Lucy spent most of the night dancing with her own friends who are very like her (excitable extroverted e.g) and dragging Danny away from his conversations with us (his friends) to dance even though he's more like us (introverted not party animals)\n\nLater Danny was being quiet so I asked if he was okay and he said just tired, but he just kept watching Lucy dancing and then said something in her ear the next time she came over and she just shook her head and laughed at him. After she went back to her friends I asked if it was bothering him how she was behaving and he asked me to explain. I mentioned the attention seeking dancing and the fact she was wearing something really revealing even though other guys were at this party. Danny said it didn't bother him then sat with a moody face.\n\nAt the end of the night Lucy sat down with us and started chatting non stop about how amazing the party had been. I pointed out jokingly Danny obviously wasn't enjoying himself since he looked miserable, and Danny told her I was worried he was jealous because of her outfit. Lucy ruffled his hair (which he hates) and said he was quiet because he loved her outfit so much he couldn't wait for us all to leave so he could \"drag\" her to bed. I thought that was completely inappropriate and said to Danny in that case I'd leave if she was just going to be disgusting and Lucy just laughed at me so I did leave.\n\nToday Danny has messaged me saying Lucy wants an apology before I'm allowed back at their home but when I asked if Lucy will apologize for making me uncomfortable he said no she doesn't have anything to be sorry about.\n\nI was genuinely only worried about my friend but admit I could have just left without calling her disgusting so AITA?\n\nETA - to clarify I didn't say the comment about her clothes directly to Lucy, I asked Danny once then never mentioned it again. I asked him because I know in the past he's said anything overly sexual makes him uncomfortable. He's not the kind of guy who makes innuendos or anything\nAlso I'm in no way jealous of Lucy, she's the opposite of how I'd want to be (which is fine people can be who they want) and Danny and I already tried dating years ago but the spark wasn't there and it was uncomfortable after we tried being intimate and we BOTH agreed we were better as completely platonic friends",
    "author": "Sea-Glass-2274",
    "ups": 10439,
    "utc_timestamp": 1682899838.0,
    "relative_time": "23 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1347bo7/aita_for_telling_my_best_friend_his_gf_is/",
    "date_time": "2023-04-30 17:10:38",
    "comments": [
        {
            "index": 1,
            "author": "[deleted]",
            "comment": "[removed]",
            "ups": 36336,
            "utc_timestamp": 1682900205.0,
            "relative_time": "23 hours ago",
            "date_time": "2023-04-30 17:16:45"
        },
        {
            "index": 2,
            "author": "Sardinesadness",
            "comment": "YTA, girl.....what? I'm sorry but that's such a hateful way to talk abt someones gf just for having fun. she was literally just minding her business having a good time &amp; you had to hate on her for it?",
            "ups": 27447,
            "utc_timestamp": 1682900185.0,
            "relative_time": "23 hours ago",
            "date_time": "2023-04-30 17:16:25"
        },
        {
            "index": 3,
            "author": "Ok_Job_9417",
            "comment": "YTA - just say that you wanna date Danny and be done with the jealously.",
            "ups": 18610,
            "utc_timestamp": 1682900889.0,
            "relative_time": "23 hours ago",
            "date_time": "2023-04-30 17:28:09"
        }
    ]
}