{
    "title": "WIBTA for not attending my twin brothers surprise birthday dinner when I was only invited as a guest",
    "selftext": "WIBTA for not attending my twin brothers surprise birthday dinner when I am only invited as a guest \n\n\nWould I be the asshole for not attending a surprise birthday dinner for my twin brother \n\nSo I’m a twin, my brother and I hang out all the time and we are super close. In a few days its our (25m) birthday. We share the same friend group and we’re all really close and have been since school. He has a close group of girl friends (about 5 of them) who I have also known for many years, I would class them as being closer with him in recent years but we are all still good friends and socialise often together. \n\nNow, I have been added to a group chat labeled “*my brothers name* surprise dinner!” It is a surprise birthday dinner for my twin brother organised by one of the girls in that group and they have invited me as a guest. One of them also said in the group that it would “be nice to see me as well” so I just feel like an afterthought. I wouldn’t really have minded if the girls wanted to organise a surprise birthday evening exclusively for my brother and themselves but they have also invited my partner and some of my brother and I’s closest friends.\n\nThis feels inconsiderate and quite upsetting as I can’t understand why I would be invited to my literal twin brothers surprise birthday dinner with me only invited as a guest as it is also my birthday involving all of our friends. My girlfriend also found this action to be extremely rude and wondered why this girl didn’t just reach out to her and then they could have organised a surprise involving both of us instead or have just involved both my brother and I and left the surprise element out of it. \n\nIn the chat it is clearly stated that we are all to arrive at one time while my brother is due to arrive 20 minutes later. The thought of attending makes me feel weird because it’s just a celebration for “his” birthday when him and I are literally born on the same day. This isn’t new information to the organiser. Also, every year my brother and I do something together because we want to and because we have the same friends, last year our friends and my girlfriend set up a massive dinner for our birthday to which everyone was invited, including the girl group. \n\nSo now I’m at a crossroads. I don’t know whether or not to attend. On one hand, if I don’t go I will feel left out because our mutual friends are going. But on the other hand if I do go, I will feel like I am letting myself be disrespected and I will likely feel uncomfortable as it feels like only my brother is being celebrated.\n\nSo, WIBTA if I took a stand and didn’t go?\n\nEDIT: my girlfriend has just checked the chat and the organiser has booked the dinner for 10 people and a set menu. There are currently 11 attending excluding my girlfriend and I. If we went, this would make it way over capacity. Now we *really* aren’t sure if we should go because what if we turn up and there is no room? This makes it slightly more awkward as we may not be able to just pull up a chair and join? The dinner is tomorrow also. \n\nThanks for all the kind messages as well, I will definitely give an update after everything plays out",
    "author": "_somethingorrather",
    "ups": 18433,
    "utc_timestamp": 1682771531.0,
    "relative_time": "17 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/132rpi2/wibta_for_not_attending_my_twin_brothers_surprise/",
    "date_time": "2023-04-29 05:32:11",
    "comments": [
        {
            "index": 1,
            "author": "KittKatt7179",
            "comment": "NTA.  I would not go.  Do something with your brother earlier that day, then treat yourself to something special with your girl later on.  And you might want to look into getting a new group of friends....are you sure they even like you?",
            "ups": 29454,
            "utc_timestamp": 1682772381.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-04-29 05:46:21"
        },
        {
            "index": 2,
            "author": "Rtarara",
            "comment": "NTA: Break the surprise and talk to your brother. Something about this is...off. I could postulate, but there is something going on here that isn't just someone wanting to throw a bday dinner. If you usually celebrate with your twin and your close friends, it sounds like this person is trying to be mean to you/disrupt that on purpose.",
            "ups": 10674,
            "utc_timestamp": 1682773689.0,
            "relative_time": "16 hours ago",
            "date_time": "2023-04-29 06:08:09"
        },
        {
            "index": 3,
            "author": "capmanor1755",
            "comment": "NTA.  It's weirdly aggressive and rude to invite you, your gf, and a bunch of your friends to a not-your-birthday party on your actual birthday.   No big deal if they'd done something with just him but by making it a surprise they're trying to trap you into going along. It's so weirdly aggressive I'd break the surprise and talk to him. In fact show him this thread.",
            "ups": 9620,
            "utc_timestamp": 1682774413.0,
            "relative_time": "16 hours ago",
            "date_time": "2023-04-29 06:20:13"
        }
    ]
}