{
    "title": "AITA for taking my BIL to small claims court over art supplies?",
    "selftext": "A bit of context: I (29M) like to draw and try other mediums as well. As such I've accumulated a lot of art supplies over the past few years. My wife (Sally 27F) also dabbles a bit and we have converted one of the rooms in our home to an art studio of sorts. There's easily a few thousand dollars worth of art supplies in that room and we tend to keep it locked for that reason. Most important to me are my pencils and markers which were not cheap (Chartpak for those who care).\n\nOnto the story: Sally and I had her family over for her aunt's birthday a few weeks back and my BIL and SIL brought their kids with them (7F and 6M). We had forgotten to lock the door to the room that day. About an hour into the party I noticed that both kids were nowhere to be seen, so I asked my SIL if she knew where they were. She said that they were drawing in the other room. I asked if my wife was with them and she said she (SIL to be clear not Sally) just told them which room it was in. I immediately rushed over to the art room and found it was a total mess. Most devastatingly was the fact that all my markers were ruined because that kids were using way to much force casing the tips to fray. I yelled at them to get out and they started crying. My BIL ran over and started yelling at me saying they're just kids and it's just markers. I told him that the markers alone were 17$ a piece and he said I was stupid for paying that much. Sally tried to diffuse the situation but my BIL starting yelling at her too saying we can't have this much art supplies and not expect kids wanting to use it. I told him he's paying to replace the markers and other supplies they ruined and he told me to go fuck myself and left. Everyone left shortly after that.\n\nI totaled up the damages and I needed to replace about 375$ and found that the kids drew on a piece I had spent the past week working on as well as ruining a finished piece Sally did. I sent him a bill and he blocked me. So I talked with my friend who was lawyer and had him draft a claim for small claims court and a letter to send my BIL (I paid him for this ofc). My wife is in agreement about this but her family has been mobbing us telling us we're being ridiculous over some markers. Only my FIL (who also has taken up painting recently) and my other SIL say that BIL has to pay. AITA?\n\nUpdate: First off, holy shit I did not expect this to blow up. I posted, figured I get a handful of responses, and turned off reddit. I am extremely grateful that so many took the time to read and respond to this post, I'm going to read as many comments as I can, but I can't read them all. Either way, thank you all.\n\nAnyways, last night my FIL called my wife and told us to come over. When we arrived my BIL and SIL were already there. FIL sat us down and told us we're figuring this out now and anyone who leaves gets written out of his will. BIL asked if he seriously would disinherit him over markers, and FIL asked him \"would you seriously get disinherited than talk this out like adults?\" He called all of us childish but figured the threat of court would make BIL admit he was at fault. He also was mad at me for reacting so nuclear and ruining aunt's bday. After an hour and half of talking BIL said he was sorry and would replace the supplies his kids ruined, I apologized for making a scene and Sally and I are taking aunt out for dinner tonight with FIL as an apology. I don't really care about the judgement here since I realize whether or not I was right for taking BIL to court because my asshood from ruining the party far outweighs that. Hopefully things mend well with my wife's family.",
    "author": "BroccoliOk923",
    "ups": 13764,
    "utc_timestamp": 1683308670.0,
    "relative_time": "22 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/138vxuu/aita_for_taking_my_bil_to_small_claims_court_over/",
    "date_time": "2023-05-05 10:44:30",
    "comments": [
        {
            "index": 1,
            "author": "MistressLiliana",
            "comment": "NTA. Parents need to watch their own kids. How entitled is it to just send them to a room in someone else's house and tell them to go wild with whatever is there without even asking? I don't get all the Y-T-A and E-S-H, saying you should have locked the door. How about the parents watch the children and make sure they stay with them? Though in this case that wouldn't have helped because they felt their kids were entitled to your stuff. The way they wrecked two pieces of actual art is the worst part of all.",
            "ups": 25475,
            "utc_timestamp": 1683309976.0,
            "relative_time": "21 hours ago",
            "date_time": "2023-05-05 11:06:16"
        },
        {
            "index": 2,
            "author": "MinerReddit",
            "comment": "~~INFO - What is Sally's position on this since it is her family.  Was she supportive to going nuclear with a small claims?~~ \n\nNTA - Considering BIL didn't offer an apology or paying anything for the damages and just further insulting you, I don't see a problem going after him.  Parents are responsible for their kids actions IMO.  You know they wont pay anything otherwise.   I am not sure if the never ending drama this will cause for the rest of your lives is worth it though.",
            "ups": 5447,
            "utc_timestamp": 1683309105.0,
            "relative_time": "22 hours ago",
            "date_time": "2023-05-05 10:51:45"
        },
        {
            "index": 3,
            "author": "TyrannasaurusRecked",
            "comment": "I'll go with NTA, based on your SIL's  comment  \"She said that they were drawing in the other room. I asked if my wife was with them and she said she just told them which room it was in. \"\n\nSIL ought to have known that you don't give your kids permission to do something like that without asking.\n\nThe small claims thing is likely to burn all bridges with that part of the family, though.",
            "ups": 4742,
            "utc_timestamp": 1683309099.0,
            "relative_time": "22 hours ago",
            "date_time": "2023-05-05 10:51:39"
        }
    ]
}