{
  'title': 'AITA for ruining my sisters gender reveal?', 
  'selftext': 'Throwaway for privacy reasons, also fake names\n\nTW: Miscarriage\n\nI am going to keep this light on details to avoid being identified so if I left anything out I\'ll try to answer\n\nBackground: I (30M) have a sister "Layla" (28F). Both me and Layla are married, I to "Pam" (29F) and Layla to "Greg" (30M). Me and my sister had a grandma who sadly passed away when we were in high school. Since we are both married and both plan on having kids, the topic of names came up and we both said we wanted to name a child after our grandma, lets say her name was Victoria. We didn\'t really fight about this per se and just agreed whoever had a daughter first could use the name. About a year ago Pam got pregnant which was very exciting. We found out it was a girl and did a gender reveal where we announced we were going to use the name Victoria. My sister was not upset about this and jokingly said something along the lines of you beat me to the punch. A few weeks after this my sister announced that she was pregnant.\n\nSadly, late into the pregnancy Pam miscarried and lost the baby. This was incredibly difficult on us and Pam suffered especially bad, both physically and mentally. My family has been there to support us but we have asked Layla to give us some space as seeing her pregnant is a lot for us at this time. While she was upset about this, she understood. Recently, my parents threw my sister a gender reveal party similar to the one we had for Pam. My Mom convinced me and Pam to go and we felt we were in a good spot to go. We get to the party and all is great until we get to the gender/name reveal. The way it was going to work was Greg\'s family was inside the garage holding a banner that would be pink or blue and say the babys name. When the garage opened me and my wife were shocked to see a banner that said "Welcome baby Victoria Greg\'s last name". I asked my sister WTF and she said since we weren\'t using the name its only fair she should get to. My wife started sobbing and I took her to my car but not before telling my sister she is an evil human being who doesn\'t deserve to be a mother. Now my Mom is mad at me because Layla also has a high-risk pregnancy and this was very stressful for her. Most of my family is saying I should apologize for what I said. AITA?\n\nETA: I think people may be confused about this and this is my fault for using the wrong words. When i say miscarried, my wife gave birth to a stillborn. while our daughter was never alive, my wife gave birth to her, it was just too early for the baby to live sadly. Our daughter is buried in a grave that says Victoria, which I think is part of the reason I was so upset'", 
  'ups': 11802, 
  'utc_timestamp': 1681953521.0, 
  'relative_time': '23 hours ago', 
  'url': 'https: //www.reddit.com/r/AmItheAsshole/comments/12sh43e/aita_for_ruining_my_sisters_gender_reveal/', 
  'date_time': '2023-04-19 18:18:41', 
  'comments': [{
    'index': 1, 
    'comment': "I'm definitely going to say a NTA, what your sister did was definitely horrible, but has she actually experienced losing a child. She probably doesn't understand the feeling. I don't think you should have gone to begin with honestly.\n\n&gt;My Mom convinced me and Pam to go and we felt we were in a good spot to go. \n\nDid your mom know what your sister was going to do? If so it's clear who is the favorite. The fact that your mom is angry to me seems like she doesn't really care about your loss. \n\nI would ask you sister that if pam did manage to give birth but V died as a toddler, if your sister would have named the next daughter she had Victoria. Your baby may not have seen the world but she was real. She was there. She was loved.\n\nI would stop talking to any family members that are mad at you for a while. None of them really cared about your loss.\n\nI'm sorry for your loss. I wish you the best regards for your's and Pam's future.\n\nEdit: spelling",
    'author': 'Puzzleheaded_Chip916', 
    'ups': 14628, 
    'utc_timestamp': 1681955071.0, 
    'relative_time': '23 hours ago'
  }, 
  {
    'index': 2, 
    'comment': 'NTA. I would edit your post to say “trigger warning still birth” not “miscarriage.” That makes a huge difference. This child was born and has a grave with her name on it. I’m so so so sorry for your loss.', 
    'author': 'EntertainmentKind252', 
    'ups': 7719, 
    'utc_timestamp': 1681956683.0, 
    'relative_time': '22 hours ago'
  },
  {
    'index': 3, 
    'comment': 'NTA, though "you don\'t deserve to be a mother" was a bit harsh. Your daughter is named "Victoria," and sis should realize that she isn\'t "using an unused name" but naming her daughter the name of her dead cousin. While, technically, she has every right to do that, it\'s morbid and sad and it will mean that their daughter will never have a good relationship with you and Pam and any future cousins she may have.', 
    'author': 'Constellation-88', 
    'ups': 4219, 
    'utc_timestamp': 1681956057.0, 
    'relative_time': '22 hours ago'
  }]
}