{
    "title": "AITA for getting a pregnancy craving during a party?",
    "selftext": "I 29 female am pregnant with my boyfriend Sam 32. Sam and I went to a party for his family. No momentous occasional just a normal family get together. During my pregnancy I have had intense cravings. \n\nWhile we were at the party I told Sam I was craving a slushee. About 30 minutes away. We had just arrived about 20 minutes prior. He said to give him a little while and we’d go get one. \n\nAfter about 30 more minutes I said it again to Sam. He said fine get in the car. On our way there we got into an argument and he thinks the craving could have waited a couple hours. He’s now mad at me we have to leave the party early. We see his family 2-3 times a month sometimes more and I don’t think it’s a big deal to leave when I have a craving. \n\nAITA?",
    "author": "Legitimate_Shop_2621",
    "ups": 9069,
    "utc_timestamp": 1683729579.0,
    "relative_time": "13 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13dsncu/aita_for_getting_a_pregnancy_craving_during_a/",
    "date_time": "2023-05-10 07:39:39",
    "comments": [
        {
            "index": 1,
            "author": "brokenhousewife_",
            "comment": "YTA, a craving is something you'd really like to have, not life or death. You acted poorly, like a child, and made both of you go. Why couldn't you go alone?",
            "ups": 43214,
            "utc_timestamp": 1683730207.0,
            "relative_time": "12 hours ago",
            "date_time": "2023-05-10 07:50:07"
        },
        {
            "index": 2,
            "author": "bigcup321",
            "comment": "**1) You really want something right now.**  \n\\- It's something you can get any day of the week.  \n\\- He wants you to wait 2 hours.\n\n**2) He really wants something right now.**  \n\\- It's something that happens once a week or less.  \n\\- You want him to wait a week or more.\n\n**Why do you win?**\n\nWhy do you get to decide that his want isn't important and he should wait instead of you waiting AND probably also being able to get what you want just 2 hours later?\n\nYTA.",
            "ups": 14566,
            "utc_timestamp": 1683730712.0,
            "relative_time": "12 hours ago",
            "date_time": "2023-05-10 07:58:32"
        },
        {
            "index": 3,
            "author": "AryaStark1313",
            "comment": "Is there a word for pregnant women that’s synonymous with “Bridezilla” for brides?\n\nThere should be.\n\nYTA for not being able to wait an hour longer.",
            "ups": 7721,
            "utc_timestamp": 1683730095.0,
            "relative_time": "12 hours ago",
            "date_time": "2023-05-10 07:48:15"
        }
    ]
}