{
    "title": "AITA for telling my ILs I will not be changing the name of my bakery just because they work there?",
    "selftext": "The bakery was originally my parents bakery, my mom's more specifically. Dad worked there but mom ran the whole thing and she was the driving force behind it. The bakery was named something with Sun in it. When my parents had me four years later they named me Sunny. My mom had a very complicated pregnancy and delivery and I was going to be their only child. So they named me after the bakery. I always loved the connection and it was especially meaningful because my mom died when I was 7. Dad kept it running with help, so I could take it over one day if I wanted to, so mom's legacy never died. He got sick when I was 16. It was tough. He fought as long as he could but he died when I was 18 and I took over the bakery. I baked from a really young age and dreamed of running it one day. So I took over as the head baker and have kept it open myself for a decade now. In that time I met and married my wife Lila, she started working there and her mom and sister also joined the small team we have. It was going well until a few months ago. We were at Lila's parents house, her whole family was there, and they brought up how the name for the bakery feels wrong when the family has changed so much. Lila told them the bakery is still mine and given the history and who named it, they shouldn't think they would get a say in any of it. It was dropped for a while. Then they brought it up again. Lila again reminded them that it was none of their business.\n\nLila is expecting our first child now and she hasn't been working as much, or at all these last couple of months, and I have noticed some comments here and there from MIL especially about \"darling bakery names\" or how nice businesses names are when they tell you it's a family run thing. I would internally roll my eyes but smile and say those were great names for those people's businesses. Clearly she got annoyed because then her and my SIL cornered me recently and told me that they felt like they had such a big part in it, which they don't, that the name should reflect the family and not just me or what my mom had wanted to call it. I told them I will not be changing the name just because they work there and if that is a problem there is no reason for them to force themselves to stay if they don't want to. Both told me they do want to work there and told me I was twisting what they said, that they just want to feel more included and like this is their family business too. MIL told me that unless we plan on naming our child some sun related name, it's just going to be a random name in the future. I pointed out many businesses are that. But they told me I was being deliberately obtuse. \n\nAITA?",
    "author": "Ok_Possibility_8497",
    "ups": 14301,
    "utc_timestamp": 1683635805.0,
    "relative_time": "17 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13coioe/aita_for_telling_my_ils_i_will_not_be_changing/",
    "date_time": "2023-05-09 05:36:45",
    "comments": [
        {
            "index": 1,
            "author": "Angusmom45325",
            "comment": "NTA and you have much bigger problems than the name of your bakery.  They think they own it now.  You need to be very clear that it is yours and only yours.  They work there only.  They do not have any say in how it is ran.  They have gotten way too comfortable.",
            "ups": 34770,
            "utc_timestamp": 1683636113.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-05-09 05:41:53"
        },
        {
            "index": 2,
            "author": "Bright_Lynx_7662",
            "comment": "NTA\n\nI am regularly surprised by the audacity of people. My dad owns the business his grandfather started. It’s named after his father. When my uncles work there, they don’t change the name.  I’m a woman, and if I take it over someday or my daughters do, it’ll still be named the way it is after a man. And I’m adopted, so it’s not even my same surname. But it has a family history to honor those who built it. \n\nYou are not only in the right to honor your mother and father’s business but realistically too. Your bakery has a name. That name is attached to advertising, reputation, etc. you would put yourself financially at risk to change it. \n\nShame on the in-laws for their selfishness. Kudos to your wife for her compassion and standing with you. \n\nCongrats on the new addition (bun in the oven?! 😂😂😂). I wish your wife and child the best health.",
            "ups": 6396,
            "utc_timestamp": 1683636430.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-05-09 05:47:10"
        },
        {
            "index": 3,
            "author": "frogmuffins",
            "comment": "NTA. \"_like this is their family business too_\". \n\n\nBut it's not their family that built this and not their business.",
            "ups": 3840,
            "utc_timestamp": 1683636933.0,
            "relative_time": "17 hours ago",
            "date_time": "2023-05-09 05:55:33"
        }
    ]
}