{
    "title": "Am I the A-Hole for telling my sister grieving her dog is not the same as me grieving my husband?",
    "selftext": "To make a long story short, I lost my husband only a month ago. It's hard, I'm still grieving and I miss him everyday. I have to take medication for depression and anxiety to help me get through the day. Last week, my sisters dog was put down due to some health issues and she was very upset, which is understandable. She called me as soon as it happened and said I was the only sibling who would understand her pain. I didn't mind, honestly I just wanted to comfort her since her dog meant the world to her. She held a wake for him and our whole family attended. It was a nice service. But now, she's comparing our losses. Telling me she knows exactly what I'm going through. That she can relate to the pain of losing someone so close to you. She calls me asking if we should visit graves together. It was fine the first time but it's constant. She goes 3 times a day. It's already difficult to go once a week for me and she knows this. I feel like she's not even considering my own grief process. Anyway, I told her that grieving her dog is not the same as grieving my husband. She's upset and refusing to talk to me now. I get it, it was uncalled for really. But my loss is new to me too and I guess I just got frustrated with how different we're dealing with our losses. Idk I feel like she should understand where I'm coming from too. A dog is not the same as a husband. A dog can't love you back like a husband can. A dog can't read to your children like a husband can. A dog can't make soup when you're ill like a husband can. It's really hard for me right now to discern when I'm being condescending or not. Idk if it's a side effect of my medication, or if the empathetic part of my brain has shut down. But I really am getting tired of her comparing our pain when she lost her dog and I lost my world. At the very least, she still has her husband. I have two young children at home, processing a loss unimaginable to most kids their age. And she's trying to whisk me away to graveyards to visit her dog. Aita? Update: There seems to be mixed opinions on this thread, which is fine. I guess people have different views on what asshole-ish behaviour is. First of all, I appreciate all of your condolences. There are just simply too many to like and respond to (although I think I got to upvote most of them) that I have decided to add it to an update. This garnered far more attention than I expected to, in all honesty, I thought the first few comments were enough. Some of these comments did cheer me up. There was a whole etymology lesson in here at some point Secondly, I know where I went wrong. It's the whole reason for the post, after all, and I can see where my sister went wrong. I will have an honest conversation with her at some point, and we have spoken since the incident. But it was mostly to do with our mother's birthday. I think we're both just in a place where the wounds are too fresh. It doesn't help that as a big sister, I am normally always her rock, but this time, I was more like a deflated balloon dealing with so many other things on my mind. It's been a rollercoaster this past month, and I think the graveyard visits were possibly more triggering than I realised at the time. I did want to be there for her initially, but it was just too much. It was never my intention to minimise anyone's pain of losing a pet, I went through a moment of selfishness where I thought she could not possibly understand my pain. I know losing a pet is a painful process for many people (I'm not really a pet person, so I guess that's where my lack of understanding comes from). But at the time, I did not think of it as insulting because I did not mean to imply she shouldn't feel grief over a pet. I had meant it as she couldn't understand the continuous effects of losing your partner and co-parent. Something new always pops up that he would normally deal with, a plumbing issue, having to fix some shelves, the kids wanting to have a barbecue. I lack in so many things he could easily sort out, and it makes me feel like a horrible parent and wife, like I was burdening him with so much. I plan to explain all of this to her. I think she'll understand. We've been through worse, and we've made it out fine. I have faith that our relationship will only become stronger from this. I love her, and as much as I am her rock, she's mine. But in this one particular instance, perhaps it's safer for our relationship that we keep a distance. We're just too different when we grieve. It's not compatible. But that doesn't mean I don't care about what she's going through.",
    "author": "smybsker",
    "ups": "10948",
    "utc_timestamp": "1684925175.0",
    "relative_time": "19 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/13qi0ic/aita_for_telling_my_sister_grieving_her_dog_is/",
    "date_time": "2023-05-24 03:46:15",
    "comments": "[{'author': '[deleted]', 'comment': '[removed]'}, {'author': 'IanDOsmond', 'comment': \"NTA. I am not going to be too mean to your sister, but she is being an A-Hole here. Not just because dogs live shorter lives than humans so it is more expected, not just that, no matter how much we love animals, humans &gt; other animals, but also because you can't necessarily compare grief in the first place. Some people are comforted by sharing similar experiences; some people find it pushy, and if you start doing that and the other person doesn't like it, you stop.\"}, {'author': 'Asleep_Dimension_120', 'comment': \"Not the A-Hole she lost a dog whilst she cared for her pet it was just that a pet. \\n\\nLossing a dog doesn't leave you worrying about paying the mortgage, how to care for your children etc. Yes she has grief but people need to stop comparing animals with humans.\"}]"
}