{
    "title": "AITA for calling out my mom on social media for abandoning me on my birthday",
    "selftext": "Context: I just turned 21 years old last month and I have spent the last few birthdays by myself due to being in college.  \n\nAbout a month before my birthday, my mom and I are sitting in the living room when she asks me “What do you wanna do for your birthday this year?” I told her that it didn’t matter as long as I got to spend it with her, seeing as I was away at college for the last two years. (I took a year off to help with family and to take care of my mental health) A week later, she tells me that she found a VR place that was open for my birthday and made reservations for us to go which I was ecstatic about. She knew how much I loved VR and her making the reservation was a good thing. A few days before my birthday, she calls me from her job and tells me she canceled our reservation to go on a “date night” with her boyfriend. When I asked her why, she said it was the only day they could get a table for the restaurant. I told her she had made a promise to spend my birthday with me and now she’s breaking it. She then said to get over it and spend the day with my gf. (My gf works for a cruise line and is out of country until July) I ended up spending my birthday alone and made a post on social media calling my mom out for abandoning me on a milestone birthday. My family is now divided. Half are siding with me, and the others are saying I’m selfish and I went too far making the post. I haven’t taken it down yet. So, am I the asshole here?\n\n\nSmall disclaimer: this is a pattern of her’s that has been going on since I was 12. Whether it’s my birthday, a competition, or an important event of mine this always happen. Just thought I’d add a little clarification. And for the people in the comments calling me her daughter, I’m her son. Her only son.",
    "author": "Dancemaster212",
    "ups": 7997,
    "utc_timestamp": 1682344444.0,
    "relative_time": "15 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/12xgkvo/aita_for_calling_out_my_mom_on_social_media_for/",
    "date_time": "2023-04-24 06:54:04",
    "comments": [
        {
            "index": 1,
            "author": "Imaginary-Fish4277",
            "comment": "NTA. Many people say OP should have called out his mom in private in stead of on SM, but that is exactly what he did. And then mom said to him get over it. So mom brought the well deserved call-out on SM entirely upon herself. Mom is a major AH, not OP.",
            "ups": 15211,
            "utc_timestamp": 1682345284.0,
            "relative_time": "15 hours ago",
            "date_time": "2023-04-24 07:08:04"
        },
        {
            "index": 2,
            "author": "SpiritedArachnid",
            "comment": "NTA. Your mom did abandon you for a date.   She prioritized her horniness over her child. She also knew so little about you and your GF that she didn't know your GF was away on business.\n\nPeople get away with being complete jerks because everyone else wants to be 'polite' and keep things private.  Calling out a jerk's bad behaviour is causing them embarrassment?  Good.  Family upset because it got pointed out?  Too bad, so sad.",
            "ups": 3990,
            "utc_timestamp": 1682345591.0,
            "relative_time": "15 hours ago",
            "date_time": "2023-04-24 07:13:11"
        },
        {
            "index": 3,
            "author": "PuzzleheadedLime6510",
            "comment": "NTA - Well well well, someone doesn’t like being call out ? Maybe she should’ve thought about it first ? \n\nWhat a selfish person, if nothing had been planned in the beginning I could have “understand” but she literally planned something and cancelled it for a date ? Is her love life more important that her kids birthday ?? She better not come crying when you don’t invite her to your great life events …",
            "ups": 1506,
            "utc_timestamp": 1682344985.0,
            "relative_time": "15 hours ago",
            "date_time": "2023-04-24 07:03:05"
        }
    ]
}