{
    "title": "Am I the A-Hole for asking my husband to file a police report against my deceased FIL",
    "selftext": "My husband (m30) and I (f27) are preparing to buy our first home. We both work full time, making above minimum wage, but not enough that either of us can get a home with our single income. \n\nYesterday, in a conversation with the bank, we were informed that there are 4 collection's accounts in my husband's name, all going back to 2018. Power, internet, and 2 credit cards. After a few hours, we were able to link each of these accounts to his father's previous address. The bill is just shy of $6,000.\n\nAfter multiple conversations, we have realized the only way to clear this debt from causing issues to his credit rating is to file a police report for fraud. \n\nHis father died suddenly last September, and my husband doesn't want to tarnish his father's name and is afraid his family will look down on him for doing this. He is on the fence of how this will look if it gets out. \n\nI look at it differently, we took a massive hit paying for the funeral (FIL had no money, and no life insurance), I know it's his dad, but we will be years recovering from the implications of this. None of the recovery agencies are willing to give us a bill paid in full, and even if we do pay this debt we will loose the down-payment we have busted our behinds to raise again over the past 7 months. We aren't even close to having the buying power we had last September because we only saved about half of our original down-payment. \n\nSo, Am I the A-Hole for asking him to make the police report. It's not an ideal situation, but how much more can I let his father's poor financial decision in life impact our future, especially now that he's gone?\n\n*Clarification for some of the most repeated questions.*\n\nAs some of you might have gathered, yes, my husband has heritage reasons for trying to honor his father even in death. He is also a Jr.\n\nHe is an only child and was raised only by his mother. His father did not sign his birth certificate, but was a large part of his life.  His father's estate is gone to probate court to be settled. \n\nBecause of his accent and his dislike for confrontation, my husband actually had me speak to everyone yesterday. Collection agencies did not have our address or his phone number, which is why we have not  even hounded. Everyone I spoke to has told me they have had no success in reaching him since they acquired the debt. So no, he wasn't hiding something. He didn't know.\n\nWe have had complications with the credit bureau for the last 3 years trying to access my husband's credit report. We have had to go to the police station and show several pieces of ID, send in letters to confirm his identity. It took the banks to get us to do everything again to resolve the issue. Originally, we thought it was because there was no activity on his credit report. Now we know that at least one account used his father's SSN with my husband's DOB and created issues. \n\nFinally, for those people who want to know what the price of my bad feelings are, I just paid 18000 out of pocket to make sure this man wasn't buried in a cardboard box. I loved my FIL, and had he told us about his financial struggles, we would have helped him. This isn't even about the money. Yesterday, I asked every agency if they would just put paid in full next to the bill, and I would pay it off. I'll save the money again. They wouldn't take the collections off his credit score. It's not 6 months worth saving that I'm concerned about. It's 3-5 years that that record can stick to his account, which will stop us from purchasing any time in the near future.\n\nFinally, my husband needed a minute, but he called me today at lunch and said he has to do what is right for our future. He is going forward with the fraud report this evening. \n\nThank you all for the reassurance 🙏 ❤️",
    "author": "toss-out-123",
    "ups": 8229,
    "utc_timestamp": 1682515041.0,
    "relative_time": "14 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/12zha3f/aita_for_asking_my_husband_to_file_a_police/",
    "date_time": "2023-04-26 06:17:21",
    "comments": [
        {
            "author": "diminishingpatience",
            "comment": "NTA. \n\n&gt;my husband doesn't want to tarnish his father's name\n\nThe person who committed fraud and has made your lives very difficult?\n\n&gt;his family will look down on him for doing this\n\nEven if they find out about it, do they want to pay off the debts?"
        },
        {
            "author": "Aunty_Fascist",
            "comment": "NTA\n\nHe tarnished his own reputation by committing identity theft and fraud. You're living and need your credit cleared. Dead guy doesn't care anymore.\n\nDon't bother telling the family. They likely will never even know about it unless you tell them."
        },
        {
            "author": "Wild_Ad_2495",
            "comment": "NTA. The man in question is dead, nothing there to tarnish. And you shouldn't be required at the expense of your finances to sweep their bad choices under the rug."
        }
    ]
}