{
    "title": "Am I the A-Hole for not watching kids at a cookout and leaving them unsupervised",
    "selftext": "I(27m) was at a backyard cookout with some friends and coworkers. So the ages were late 20s to early 40s. It was a family friendly event so people brought their kids. They were playing in the yard while most of the adults hung out on the backyard deck. And like always, the parents saw other adults in the area and decided to just walk away and go inside. I don't know why this is a thing a lot of parents tend to do. Parents, why do you just walk away  at outings and expect other people to watch your kids? I don't get it. I could see if it is your immediate family but even then I would warn someone that I was not going to be watching for the safety of my kids.\n\n&amp;#x200B;\n\nIt was near the end of the night so some people were gone. It was also getting dark and colder so people were inside. The kids were still running around the playing outside I decided to go home. I went inside and said goodbye to the host. Then I got in my car out front and was on my phone for a minute and someone angrily walked up and asked me why I left the backyard. They said I was back there and they were counting on me to watch the kids. Note that this was never said to me. They just went inside and said nothing. I was on the deck and at no point in the night was I ever paying attention to the kids. Nothing dangerous happened to the kids. The parent just saw me walking to my car and freaked out. I told her it's not my job to watch your kids but I probably would have stuck around IF I was asked. I was just sitting on the deck drinking beer and minding my own business. I had already been going back and forth from outside to socialize the whole night like everyone else. Not sure why I was the one singled out. There were times when another person happened to be outside and I was inside. Did they assume we were taking shifts? I don't get the mentality of parents but maybe I'm the asshole here.\n\n&amp;#x200B;\n\nAlso want to note that the backyard is NOT fenced off. She brought that up a lot and I just retorted with \"even more reason to stay with your kids.\" The backyard was one of those open ones that opens into the forest.\n\n&amp;#x200B;\n\nBEfore this gets out of hand. I did not drive drunk. I had a single drink and was not drunk or even somewhat tipsy.\n\n&amp;#x200B;\n\nedt\n\nI don't think it's clear so I will clarify. I had no knowledge of being on kid duty. The backyard is large and open and lead into the forest. I was on the small deck by the house. At no point in the night was I watching or listening to for kids. The whole night I was periodically going inside and outside freely. Never considered kids because I assumed the responsible parents were keeping an eye out",
    "author": "ifonlyyoudstop",
    "ups": 8879,
    "utc_timestamp": 1682429065.0,
    "relative_time": "16 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/12yjcog/aita_for_not_watching_kids_at_a_cookout_and/",
    "date_time": "2023-04-25 06:24:25",
    "comments": [
        {
            "author": "DominantGamiing",
            "comment": "Dude, you definitely are NTA. You are not a babysitter. You should not be held in any position to watch their kids.\n\nEdit: Holy cow this blew up, RIP inbox. Thank you so much random stranger for my first ever gold!"
        },
        {
            "author": "SpecialistAfter511",
            "comment": "NTA! That parent has some nerve! You are not psychic!! They are out of line."
        },
        {
            "author": "HoledFoodz",
            "comment": "NTA.  It took me a while to figure out none of the kids were even yours, because their reaction makes no sense at all LOL\n\nJust assuming someone else is watching your kids is pretty ridiculous."
        }
    ]
}