{
    "title": "Am I the A-Hole for putting meat in a tofu dish?",
    "selftext": "This happened at a potluck. I brought a dish that was tofu stirfried with minced pork, ginger and spring onions. Similar to mapo tofu but not spicy.\n\nEverything was fine except when someone asked me if my dish was halal, I said no, it has pork. That's when Jen overheard and freaked out that she ate meat. And it turns out a lot of other vegetarians ate my dish assuming it was vegetarian. For the rest of the party, I've had so many people(including non-vegetarians) tell me I'm an AH for putting meat in a vegetarian dish. But this is a dish I grew up with, tofu for me is just an ingredient, not strictly a meat substitute. Also, no one asked me if my dish was vegetarian.\n\nSo am I the AH here or are people just overreacting?\n\nEdit: Sinse so many people are asking. Nothing was labled. I just left the dish on the buffet table along with the rest of the dishes. There were many other meat dishes. About 20 people at the party, 4 were vegetarian. No one asked about my dish excet for the person asking if it was halal.",
    "author": "Unhappy-Fault-3126",
    "ups": 9380,
    "utc_timestamp": 1682522776.0,
    "relative_time": "15 hours ago",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/12zku7a/aita_for_putting_meat_in_a_tofu_dish/",
    "date_time": "2023-04-26 08:26:16",
    "comments": [
        {
            "author": "YouSayWotNow",
            "comment": "They assumed it was a vegetarian dish because they have a weird misconception that tofu exists only for vegetarians.\n\nThat they didn't bother to ask is on them.\n\nNTA"
        },
        {
            "author": "Baejax_the_Great",
            "comment": "NTA. Chinese tofu dishes (and other vegetable dishes!) often contain pork to add flavor. It's not your fault they didn't know that, and I'd bet they've accidentally eaten pork at Chinese food places since they didn't."
        },
        {
            "author": "Firebreathingshihtzu",
            "comment": "NTA Mapo tofu usually comes with meat. The person that asked if it was halal was responsible. The vegetarians that ate it were not responsible.\n\nI live in an extremely health conscious area and know several people w/ allergies so I've started to put a list of ingredients with dishes I bring to potlucks."
        }
    ]
}